In [5]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# Lecture 11 #

## Lists

In [1]:
# list of numbers
[1, 2, 3]

[1, 2, 3]

In [2]:
# list of strings and numbers
['hello', 1, 2, 3]

['hello', 1, 2, 3]

In [3]:
# list of strings, numbers and boolean
simple_list = ['hello', 7, 3.14, True]
simple_list

['hello', 7, 3.14, True]

In [6]:
# nest an array within my list
my_array = make_array(1, 2, 3)

crowded_list = [my_array, 'what is going on', -10]
crowded_list

[array([1, 2, 3]), 'what is going on', -10]

In [7]:
type(crowded_list)

list

In [8]:
# create a table with a list
Table().with_columns('Numbers', [1, 2, 3])

Numbers
1
2
3

In [9]:
# populate column labels in a table, with a list
drinks = Table(['Drink', 'Cafe', 'Price'])
drinks

Drink | Cafe | Price

In [10]:
# define rows within a table, with lists!
drinks = drinks.with_rows([
    ['Milk Tea', 'Asha', 5.5],
    ['Espresso', 'Strada',  1.75],
    ['Latte',    'Strada',  3.25],
    ['Espresso', "FSM",   2]
])
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

## Grouping by one column

In [11]:
survey = Table.read_table('ds1-survey-pronouns.csv')
survey.show(15)

In [12]:
survey.group('Charity').show()

In [13]:
survey.group('Job', np.average)

Job                              | Pronouns average | Prior experience average | Confidence in programming average | Confidence in viz average | Lecture Pace average | Lecture preference average | Random1 average | Random2 average | Letter1 average | Letter2 average | Charity average
A job I love that makes $100,000 |                  |                          |                                   |                           |                      |                            | 5.16667         | 34              |                 |                 | 62.1667
a job I hate that makes $500,000 |                  |                          |                                   |                           |                      |                            | 5.58333         | 44.6667         |                 |                 | 33.75

In [14]:
(survey.select('Charity', 'Job').group('Job', np.average))

Job                              | Charity average
A job I love that makes $100,000 | 62.1667
a job I hate that makes $500,000 | 33.75

In [16]:
# how would you using similar code as above
# show the relationship between pronouns and charity average? 
(survey.select('Pronouns', 'Charity').group('Pronouns', np.average))

Pronouns     | Charity average
he/him/his   | 40.5
she/her/hers | 46.625

In [ ]:
#what happens when you group by charity instead?

## Cross-classification: grouping by two columns

In [18]:
survey.group(['Pronouns']).show()

In [17]:
survey.group(['Pronouns','Charity']).show()

/opt/conda/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

In [19]:
survey.pivot('Pronouns', 'Charity')

Charity | he/him/his | she/her/hers
0       | 1          | 0
5       | 0          | 1
10      | 1          | 1
15      | 1          | 0
20      | 1          | 0
30      | 1          | 2
40      | 1          | 0
50      | 2          | 2
90      | 1          | 0
98      | 0          | 1
... (1 rows omitted)

In [20]:
survey.pivot('Pronouns', 'Job', 'Charity', np.average)

Job                              | he/him/his | she/her/hers
A job I love that makes $100,000 | 56.6667    | 67.6667
a job I hate that makes $500,000 | 33.5714    | 34

In [21]:
(survey.select('Job', 'Pronouns', 'Charity')
       .group(['Job','Pronouns'], np.average)).show()

In [22]:
# Here, pivot doesn't know how to aggregate the Charity values
# for each subgroup of students
survey.pivot('Pronouns', 'Job', 'Charity')

TypeError: values requires collect to be specified

## Challenge Question ##

In [23]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2021 - sky.column('completed'))
          .drop('completed'))
sky.show(3)

In [ ]:
# 1. For each city, what’s the tallest building for each material?

In [ ]:
# 2. For each city, what’s the height difference between the tallest 
#    steel building and the tallest concrete building?

Don't read ahead until you try the challenge questions yourself first!

In [27]:
# 1. For each city, what’s the tallest building for each material?

sky.select('name','material', 'city', 'height').group(['city', 'material'], max)

city      | material        | name max                                | height max
Atlanta   | concrete        | Westin Peachtree Plaza                  | 264.25
Atlanta   | mixed/composite | Two Alliance Center                     | 311.8
Atlanta   | steel           | State of Georgia Building               | 169.47
Austin    | concrete        | Windsor on the Lake                     | 208.15
Austin    | steel           | University of Texas Tower               | 93.6
Baltimore | concrete        | The John and Frances Angelos Law Center | 161.24
Baltimore | steel           | Mercy Medical Center Inpatient Tower    | 155.15
Boston    | concrete        | Harbor Towers II                        | 121.92
Boston    | mixed/composite | Ellison Building                        | 139
Boston    | steel           | Two International Place                 | 240.79
... (81 rows omitted)

In [32]:
# 1. For each city, what’s the tallest building for each material?
sky_p = sky.pivot('material', 'city', 'height', max)
sky_p = sky_p.drop("mixed/composite")
sky_p

city       | concrete | steel
Atlanta    | 264.25   | 169.47
Austin     | 208.15   | 93.6
Baltimore  | 161.24   | 155.15
Boston     | 121.92   | 240.79
Charlotte  | 265.48   | 179.23
Chicago    | 423.22   | 442.14
Cincinnati | 125      | 175
Cleveland  | 125      | 215.8
Columbus   | 79.25    | 169.3
Dallas     | 176.48   | 270.06
... (25 rows omitted)

In [28]:
# 2. For each city, what’s the height difference between the tallest 
#    steel building and the tallest concrete building?


sky_p = sky_p.with_column(
    'difference', 
    abs(sky_p.column('steel') - sky_p.column('concrete'))
)
sky_p

city       | concrete | mixed/composite | steel  | difference
Atlanta    | 264.25   | 311.8           | 169.47 | 94.78
Austin     | 208.15   | 0               | 93.6   | 114.55
Baltimore  | 161.24   | 0               | 155.15 | 6.09001
Boston     | 121.92   | 139             | 240.79 | 118.87
Charlotte  | 265.48   | 239.7           | 179.23 | 86.25
Chicago    | 423.22   | 306.94          | 442.14 | 18.92
Cincinnati | 125      | 202.69          | 175    | 50
Cleveland  | 125      | 288.65          | 215.8  | 90.8
Columbus   | 79.25    | 0               | 169.3  | 90.05
Dallas     | 176.48   | 280.72          | 270.06 | 93.58
... (25 rows omitted)

In [29]:
sky_p.sort('difference', True)

city              | concrete | mixed/composite | steel  | difference
Sunny Isles Beach | 196      | 0               | 0      | 196
Las Vegas         | 350.22   | 195.68          | 164.6  | 185.62
Miami Beach       | 170.39   | 0               | 0      | 170.39
Pittsburgh        | 89.3     | 172             | 256.34 | 167.04
Los Angeles       | 145.7    | 118.26          | 310.29 | 164.59
Philadelphia      | 157.89   | 296.73          | 288.04 | 130.15
Boston            | 121.92   | 139             | 240.79 | 118.87
Austin            | 208.15   | 0               | 93.6   | 114.55
Seattle           | 138.69   | 284.38          | 235.31 | 96.62
Atlanta           | 264.25   | 311.8           | 169.47 | 94.78
... (25 rows omitted)

### Take-home question: try it here!

In [ ]:
# Generate a table of the names of the oldest buildings for each 
# material for each city:

## Joins ##

In [ ]:
drinks

In [ ]:
discounts = Table().with_columns(
    'Coupon % off', make_array(10, 25, 5),
    'Location', make_array('Asha', 'Strada', 'Asha')
)
discounts

In [ ]:
combined = drinks.join('Cafe', discounts, 'Location')
combined

In [ ]:
discounted_frac = 1 - combined.column('Coupon % off') / 100
combined.with_column(
    'Discounted Price', 
    combined.column('Price') * discounted_frac
)

In [ ]:
drinks.join('Cafe', drinks, 'Cafe')